# encoding: utf-8
'''
@author: developer
@software: python
@file: movie_doubantest.py
@time: 2019/12/20 0:53
@desc:
'''
import requests
from bs4 import BeautifulSoup


def get_movies():
    headers = {'user-agent':'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.79 Safari/537.36'}
    movie_list = []
    for i in range(0, 10):
        link = "https://movie.douban.com/top250?start="+str(25 * i)
        r = requests.get(link, headers=headers, timeout=10)
        print(str(i+1), "响应状态码：", r.status_code)
        soup = BeautifulSoup(r.text, "lxml")
        div_list = soup.find_all('div', class_='hd')
        for each in div_list:
            movie = each.a.span.text.strip()
            movie_list.append(movie)
    return movie_list


movies_top_250 = get_movies()
print(movies_top_250)
print(len(movies_top_250))

'''
1 响应状态码： 200
2 响应状态码： 200
3 响应状态码： 200
4 响应状态码： 200
5 响应状态码： 200
6 响应状态码： 200
7 响应状态码： 200
8 响应状态码： 200
9 响应状态码： 200
10 响应状态码： 200
['肖申克的救赎', '霸王别姬', '阿甘正传', '这个杀手不太冷', '美丽人生', '泰坦尼克号', '千与千寻', '辛德勒的名单', '盗梦空间', '忠犬八公的故事', '海上钢琴师', '机器人总动员', '三傻大闹宝莱坞', '楚门的世界', '放牛班的春天', '星际穿越', '大话西游之大圣娶亲', '熔炉', '龙猫', '无间道', '教父', '疯狂动物城', '当幸福来敲门', '怦然心动', '触不可及', '蝙蝠侠：黑暗骑士', '活着', '控方证人', '乱世佳人', '少年派的奇幻漂流', '摔跤吧！爸爸', '指环王3：王者无敌', '飞屋环游记', '鬼子来了', '十二怒汉', '天空之城', '寻梦环游记', '末代皇帝', '天堂电影院', '大话西游之月光宝盒', '哈尔的移动城堡', '罗马假日', '搏击俱乐部', '闻香识女人', '素媛', '辩护人', '何以为家', '窃听风暴', '死亡诗社', '教父2', '两杆大烟枪', '指环王2：双塔奇兵', '飞越疯人院', '狮子王', '指环王1：魔戒再现', 'V字仇杀队', '美丽心灵', '饮食男女', '大闹天宫', '哈利·波特与魔法石', '钢琴家', '海豚湾', '本杰明·巴顿奇事', '黑客帝国', '情书', '看不见的客人', '让子弹飞', '我不是药神', '西西里的美丽传说', '猫鼠游戏', '小鞋子', '拯救大兵瑞恩', '美国往事', '音乐之声', '致命魔术', '七宗罪', '低俗小说', '穿条纹睡衣的男孩', '被嫌弃的松子的一生', '沉默的羔羊', '蝴蝶效应', '春光乍泄', '心灵捕手', '禁闭岛', '勇敢的心', '布达佩斯大饭店', '剪刀手爱德华', '天使爱美丽', '阿凡达', '摩登时代', '加勒比海盗', '致命ID', '幽灵公主', '断背山', '入殓师', '喜剧之王', '阳光灿烂的日子', '重庆森林', '狩猎', '第六感', '海蒂和爷爷', '杀人回忆', '玛丽和马克思', '小森林 夏秋篇', '消失的爱人', '请以你的名字呼唤我', '告白', '一一', '大鱼', '爱在黎明破晓前', '红辣椒', '阳光姐妹淘', '侧耳倾听', '7号房的礼物', '射雕英雄传之东成西就', '甜蜜蜜', '超脱', '哈利·波特与死亡圣器(下)', '倩女幽魂', '小森林 冬春篇', '驯龙高手', '蝙蝠侠：黑暗骑士崛起', '菊次郎的夏天', '恐怖直播', '爱在日落黄昏时', '唐伯虎点秋香', '萤火之森', '幸福终点站', '超能陆战队', '借东西的小人阿莉埃蒂', '风之谷', '无人知晓', '神偷奶爸', '上帝之城', '绿皮书', '怪兽电力公司', '玩具总动员3', '血战钢锯岭', '电锯惊魂', '岁月神偷', '喜宴', '七武士', '谍影重重3', '时空恋旅人', '英雄本色', '完美的世界', '傲慢与偏见', '疯狂原始人', '萤火虫之墓', '东邪西毒', '教父3', '爆裂鼓手', '真爱至上', '被解救的姜戈', '心迷宫', '纵横四海', '贫民窟的百万富翁', '记忆碎片', '黑天鹅', '三块广告牌', '荒蛮故事', '达拉斯买家俱乐部', '哪吒闹海', '我是山姆', '你的名字。', '花样年华', '雨人', '卢旺达饭店', '天书奇谭', '头号玩家', '头脑特工队', '你看起来好像很好吃', '功夫', '海边的曼彻斯特', '无敌破坏王', '未麻的部屋', '恋恋笔记本', '忠犬八公物语', '冰川时代', '一个叫欧维的男人决定去死', '模仿游戏', '二十二', '虎口脱险', '黑客帝国3：矩阵革命', '雨中曲', '海洋', '海街日记', '人工智能', '房间', '魔女宅急便', '恐怖游轮', '燃情岁月', '惊魂记', '穿越时空的少女', '罗生门', '魂断蓝桥', '釜山行', '完美陌生人', '疯狂的石头', '奇迹男孩', '猜火车', '终结者2：审判日', '人生果实', '阿飞正传', '可可西里', '香水', '初恋这件小事', '牯岭街少年杀人事件', '新世界', '谍影重重2', '2001太空漫游', '谍影重重', '战争之王', '爱在午夜降临前', '地球上的星星', '青蛇', '浪潮', '朗读者', '新龙门客栈', '无耻混蛋', '源代码', '绿里奇迹', '步履不停', '哈利·波特与阿兹卡班的囚徒', '小萝莉的猴神大叔', '血钻', '城市之光', '再次出发之纽约遇见你', '彗星来的那一夜', '追随', '疯狂的麦克斯4：狂暴之路', '哈利·波特与密室', '一次别离', '东京物语', '聚焦', '遗愿清单', '小偷家族', '撞车', '发条橙', '色，戒', '梦之安魂曲', '黑鹰坠落', '驴得水', '大佛普拉斯', '我爱你', 'E.T. 外星人', '末路狂花', '千钧一发', '变脸', '这个男人来自地球']
250
'''